Autodesk.Revit.DB.Structure.ReinforcementSettings.RebarVaryingLengthNumberSuffix
A unique identifier used for a bar within a variable length rebar set.
Remarks:
This property is assigned to rebar sets with varying length bars only if they are numbered as a whole
(i.e. NumberVaryingLengthRebarsIndividually is set to false).
The values for this property are valid if :
Input contains at least one character.Input contains either alphabetical or numeric characters (not both).
When this property is used, each bar in a set with varying length bars will be assigned an incremented value of the suffix.
As an example, the suffix values for three bars in a varying set are:
For alphabetic suffix : Aaz -> Aba -> Abb.For numeric suffix : 129 -> 130 -> 131.
These values are automatically incremented by the system.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The rebar number suffix is not valid if :
Input is empty.Input contains non-alphanumeric characters.Input contains both numeric and alphabetic characters.Input is a value that exceeds the maximum  integer representation.Input contains more than 6 alphabetic characters.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2017

Autodesk.Revit.DB.Structure.ReinforcementSettings.NumberingMethod
Identifies the type of the numbering method.
Remarks:
This property can be used to modify the way that rebar sets with varying length bars are numbered.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2026